app/views/people/show.html.erb

SELECT * FROM "projects" INNER JOIN "people_projects" ON "projects".id = "people_projects".project_id WHERE ("people_projects".person_id = 6 )
---
<div id="all">
	<% @person.projects.each do |project| %>

SELECT "videos".* FROM "videos" WHERE ("videos".project_id = 4)
---
		<div id="images">
			<% project.videos.each do |video| %>

SELECT * FROM "images" INNER JOIN "images_projects" ON "images".id = "images_projects".image_id WHERE ("images_projects".project_id = 4 )
---
			<% end %>
			<% project.images.each do |image| %>