app/views/projects/_project.html.erb

SELECT * FROM "people" INNER JOIN "people_projects" ON "people".id = "people_projects".person_id WHERE ("people_projects".project_id = 1 )
---
	<div class="work">
		<% project.people.each do |person| %>