app/views/projects/show.html.erb

<div id="images">
	<% @project.projectimages.each do |image| %>
---
SELECT "images".* FROM "images" WHERE ("images".project_id = 9)

	<ul>
<% @project.categories.each do |category| %>
---
SELECT * FROM "categories" INNER JOIN "categories_projects" ON "categories".id = "categories_projects".category_id WHERE ("categories_projects".project_id = 2 )