app/controllers/categories_controller.rb

  def index
    @nav = Category.all
---
SELECT "categories".* FROM "categories"