app/controllers/pages_controller.rb

  def catlist
    @title = "Categories Cats"
    @navs = Category.all.sort! { |a,b| a.name.downcase <=> b.name.downcase }
---
SELECT "categories".* FROM "categories"