app/controllers/people_controller.rb

  def index
    @title = "People"
    @people = Person.all.sort!{ |a,b| a.lname.downcase <=> b.lname.downcase }
    @navs = Major.all.sort! { |a,b| a.name.downcase <=> b.name.downcase }
---
SELECT "majors".* FROM "majors" WHERE ("majors"."name" = 'Visual Communication Design') LIMIT 1