app/controllers/projects_controller.rb

  def index
    @title = "Work"
    @solo_projects = Project.all
    @group_projects = GroupProject.all
    @projects = @solo_projects + @group_projects
    @navs = Category.all.sort! { |a,b| a.name.downcase <=> b.name.downcase }
---
SELECT "projects".* FROM "projects"
SELECT "categories".* FROM "categories" LIMIT 1 OFFSET 3

  def show
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 1) LIMIT 1